-- phpMyAdmin SQL Dump
-- version 4.4.14
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Янв 08 2016 г., 15:48
-- Версия сервера: 5.6.26
-- Версия PHP: 5.6.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `andria`
--
CREATE DATABASE IF NOT EXISTS `andria` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `andria`;

-- --------------------------------------------------------

--
-- Структура таблицы `category`
--

DROP TABLE IF EXISTS `category`;
CREATE TABLE IF NOT EXISTS `category` (
  `id` int(11) NOT NULL,
  `parent_id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `subname` varchar(256) NOT NULL,
  `filters` text NOT NULL,
  `active` int(1) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `category`
--

INSERT INTO `category` (`id`, `parent_id`, `name`, `subname`, `filters`, `active`) VALUES
(1, 0, 'Мотозапчасти', 'motozapchasti', '1', 1),
(2, 1, 'asd1', 'asd1', '', 1),
(3, 2, '123123', '123123', '', 1),
(4, 1, 'qwe', 'qwe', '', 1),
(5, 0, 'Генераторы', 'generatory', '', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `contacts`
--

DROP TABLE IF EXISTS `contacts`;
CREATE TABLE IF NOT EXISTS `contacts` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `email` text NOT NULL,
  `enquiry` text NOT NULL,
  `aname` text NOT NULL,
  `answer` text NOT NULL,
  `date` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `contacts`
--

INSERT INTO `contacts` (`id`, `name`, `email`, `enquiry`, `aname`, `answer`, `date`) VALUES
(1, 'Виталий', 'sibiryakov.ya@gmail.com', 'Это ваще работает?', '', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `filters`
--

DROP TABLE IF EXISTS `filters`;
CREATE TABLE IF NOT EXISTS `filters` (
  `id` int(11) NOT NULL,
  `parameter` text NOT NULL,
  `type` int(1) NOT NULL,
  `atr` text NOT NULL,
  `name` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `filters`
--

INSERT INTO `filters` (`id`, `parameter`, `type`, `atr`, `name`) VALUES
(1, 'moschnostj', 0, 'л.с.', 'Мощность');

-- --------------------------------------------------------

--
-- Структура таблицы `img`
--

DROP TABLE IF EXISTS `img`;
CREATE TABLE IF NOT EXISTS `img` (
  `name` text NOT NULL,
  `datestamp` bigint(16) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

DROP TABLE IF EXISTS `orders`;
CREATE TABLE IF NOT EXISTS `orders` (
  `id` int(11) NOT NULL,
  `text` text NOT NULL,
  `price` int(11) NOT NULL,
  `info` text NOT NULL,
  `phone` varchar(15) NOT NULL,
  `datestamp` bigint(16) NOT NULL,
  `address` text NOT NULL,
  `name` text NOT NULL,
  `ip` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

DROP TABLE IF EXISTS `products`;
CREATE TABLE IF NOT EXISTS `products` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL,
  `category` varchar(256) NOT NULL DEFAULT 'category',
  `price` int(11) NOT NULL,
  `img` text NOT NULL,
  `moschnostj` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `category`, `price`, `img`, `moschnostj`) VALUES
(1, 'Тестовый', 'Мотозапчасти', 100, '87c4fe8affdd93e24ffaa25ed26a51d9.jpg', '4'),
(3, 'Двигатель Lifan152F', 'Мотозапчасти', 123, '914b37b5a284587141d3ea9511688f06.jpg', '9'),
(4, 'asd', 'Мотозапчасти', 123, 'c6b12b8069f2429db95c22cde2873885.jpg', '4');

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

DROP TABLE IF EXISTS `settings`;
CREATE TABLE IF NOT EXISTS `settings` (
  `name` varchar(255) NOT NULL,
  `parameter` text NOT NULL,
  `value` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `settings`
--

INSERT INTO `settings` (`name`, `parameter`, `value`) VALUES
('Адрес', 'storeaddress', 'Мира 82'),
('Название сайта', 'storename', 'VologdaParts'),
('Телефон', 'storephone', '89005561859'),
('Электронный адрес', 'storeemail', 'sibiryakov.ya@gmail.com');

-- --------------------------------------------------------

--
-- Структура таблицы `streets`
--

DROP TABLE IF EXISTS `streets`;
CREATE TABLE IF NOT EXISTS `streets` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=360 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `streets`
--

INSERT INTO `streets` (`id`, `name`) VALUES
(1, 'Вологодская'),
(3, 'Благовещенская'),
(4, 'Северная'),
(5, 'Огородный пер.'),
(6, 'Водников пер.'),
(7, 'Мира'),
(8, 'Дальняя'),
(9, 'Гагарина'),
(10, 'Петина'),
(11, '1-ая Садовая'),
(12, '1-ая Фрязиновская'),
(13, '2-ая Кирилловская'),
(14, '2-ая Садовая'),
(15, '3-го Интернационала'),
(16, '3-я Садовая'),
(17, '4-ая Полевая'),
(18, '4-ая Садовая'),
(19, '5-ая Садовая'),
(20, '6-ая Садовая'),
(21, '7-ая Садовая'),
(22, '8-ая Садовая'),
(23, 'Авксентьевского'),
(24, 'Александра Клубова'),
(25, 'Ананьинская'),
(26, 'Архангельская'),
(27, 'Баранковская'),
(28, 'Батюшкова'),
(29, 'Береговая'),
(30, 'Болонина'),
(31, 'Бурмагиных'),
(32, 'Варенцовой'),
(33, 'Ветошкина'),
(34, 'Водников'),
(35, 'Возрождения'),
(36, 'Вологодская слобода'),
(37, 'Воркутинская'),
(38, 'Воровского'),
(39, 'Воронежская'),
(40, 'Восточная'),
(41, 'Галкинская'),
(42, 'Геофизическая'),
(43, 'Герцена'),
(44, 'Гиляровского'),
(45, 'Гмайнера'),
(46, 'Говоровская'),
(47, 'Гоголя'),
(48, 'Головиновская'),
(49, 'Гончарная'),
(50, 'Горка'),
(51, 'Городской Вал'),
(52, 'Горького'),
(53, 'Граничная'),
(54, 'Дачная'),
(55, 'Детская'),
(56, 'Дзержинского'),
(57, 'Добролюбова'),
(58, 'Довратская'),
(59, 'Доронинская'),
(60, 'Дубровская'),
(61, 'Дьяконовская'),
(62, 'Евковская'),
(63, 'Екимцевская'),
(64, 'Ершовская'),
(65, 'Есенинская'),
(66, 'Ефимьевская'),
(67, 'Железнодорожная'),
(68, 'Живописная'),
(69, 'Завражская'),
(70, 'Загадочная'),
(71, 'Заливная'),
(72, 'Залинейная'),
(73, 'Западная'),
(74, 'Заречная'),
(75, 'Засодимского'),
(76, 'Звездная'),
(77, 'Зеленая'),
(78, 'Зосимовская'),
(79, 'Ильинская'),
(80, 'Ильюшина'),
(81, 'Индустриальная'),
(82, 'Казакова'),
(83, 'Каменный Мост'),
(84, 'Канифольная'),
(85, 'Карла Маркса'),
(86, 'Кирова'),
(87, 'Кирпичная'),
(88, 'Козленская'),
(89, 'Колхозная'),
(90, 'Коммунистическая'),
(91, 'Комсомольская'),
(92, 'Коничева'),
(93, 'Копанка'),
(94, 'Копрецовская'),
(95, 'Короткая'),
(96, 'Космонавта Беляева'),
(97, 'Костромская'),
(98, 'Красноармейская'),
(99, 'Крюк'),
(100, 'Кубинская'),
(101, 'Кувшиновская'),
(102, 'Лаврова'),
(103, 'Левичева'),
(104, 'Леденцова'),
(105, 'Ленина'),
(106, 'Ленинградская'),
(107, 'Лермонтова'),
(108, 'Лесобиржа'),
(109, 'Лечебная'),
(110, 'Линейная'),
(111, 'Ловенецкого'),
(112, 'Луговая'),
(113, 'Лукьяновская'),
(114, 'Луначарского'),
(115, 'М. И. Ульяновой'),
(116, 'Малая Сибирская'),
(117, 'Малиновая'),
(118, 'Мальцева'),
(119, 'Маршала Конева'),
(120, 'Машиностроительная'),
(121, 'Маяковского'),
(122, 'Медуницинская'),
(123, 'Мелиораторов'),
(124, 'Михаила Поповича'),
(125, 'Мишкольцская'),
(126, 'Можайского'),
(127, 'Молодежная'),
(128, 'Монастырская'),
(129, 'Московская'),
(130, 'Мохова'),
(131, 'Мудрова'),
(132, 'Набережная'),
(133, 'Народная'),
(134, 'Некрасова'),
(135, 'Николая Рубцова'),
(136, 'Никольская'),
(137, 'Новгородская'),
(138, 'Образцова'),
(139, 'Овражная'),
(140, 'Одесская'),
(141, 'Октябрьская'),
(142, 'Ольховая'),
(143, 'Осаново'),
(144, 'Осановская'),
(145, 'Открытая'),
(146, 'Охмыльцевская'),
(147, 'Панкратова'),
(148, 'Первомайская'),
(149, 'Песочная'),
(150, 'Петрозаводская'),
(151, 'Пионерская'),
(152, 'Пирогова'),
(153, 'Планерная'),
(154, 'Полевая'),
(155, 'Полярная'),
(156, 'Поселковая'),
(157, 'Почтовая'),
(158, 'Предтеченская'),
(159, 'Преображенского'),
(160, 'Пригородная'),
(161, 'Прилуцкая'),
(162, 'Присухонская'),
(163, 'Проектируемая'),
(164, 'Прокатова'),
(165, 'Пролетарская'),
(166, 'Промплощадка'),
(167, 'Промышленная'),
(168, 'Профсоюзная'),
(169, 'Прядильщиков'),
(170, 'Псковская'),
(171, 'Пугачева'),
(172, 'Путейская'),
(173, 'Пушкинская'),
(174, 'Рабочая'),
(175, 'Разина'),
(176, 'Республиканская'),
(177, 'Ростиловская'),
(178, 'Рощинская'),
(179, 'Рыбкино'),
(180, 'Рыбная'),
(181, 'Рябиновая'),
(182, 'Садовая'),
(183, 'Саммера'),
(184, 'Самойло'),
(185, 'Связи'),
(186, 'Сергея Орлова'),
(187, 'Сергея Преминина'),
(188, 'Сиреневая'),
(189, 'Слободская'),
(190, 'Сметьевская'),
(191, 'Сокольская'),
(192, 'Солнечная'),
(193, 'Солодунова'),
(194, 'Спирина'),
(195, 'Средняя'),
(196, 'Строителей'),
(197, 'Судоремонтная'),
(198, 'Сухонская'),
(199, 'Текстильщиков'),
(200, 'Тендрякова'),
(201, 'Тепенькинская'),
(202, 'Техническая'),
(203, 'Тихая'),
(204, 'Товарная'),
(205, 'Трактористов'),
(206, 'Транспортная'),
(207, 'Трудовая'),
(208, 'Турундаевская'),
(209, 'Угловая'),
(210, 'Ударников'),
(211, 'Уральская'),
(212, 'Усадебная'),
(213, 'Фрязиновская'),
(214, 'Хлюстова'),
(215, 'Хорхоринская'),
(216, 'Цветочная'),
(217, 'Центральная'),
(218, 'Чапаева'),
(219, 'Чапыжник'),
(220, 'Челюскинцев'),
(221, 'Череповецкая'),
(222, 'Чернышевского'),
(223, 'Чернышовская'),
(224, 'Четряковская'),
(225, 'Чехова'),
(226, 'Чкалова'),
(227, 'Шараповская'),
(228, 'Шевяковская'),
(229, 'Шекснинская'),
(230, 'Шмидта'),
(231, 'Щеглинская'),
(232, 'Щетинина'),
(233, 'Элеваторная'),
(234, 'Энгельса'),
(235, 'Энергетиков'),
(236, 'Южакова'),
(237, 'Южная'),
(238, 'Ягодная'),
(239, 'Ярославская'),
(240, 'Яшина'),
(241, 'пер. 1-ый Доронинский'),
(242, 'пер. 1-ый Тихий'),
(243, 'пер. 1-ый Турундаевский'),
(244, 'пер. 2-ой Говоровский'),
(245, 'пер. 2-ой Доронинский'),
(246, 'пер. 2-ой Пролетарский'),
(247, 'пер. 2-ой Турундаевский'),
(248, '3-ий Говоровский'),
(249, 'пер. 3-ий Говоровский'),
(250, 'пер. 3-ий Доронинский'),
(251, 'пер. 3-ий Турундаевский'),
(252, 'пер. 4-ый Доронинский'),
(253, 'пер. 4-ый Турундаевский'),
(254, 'пер. Аллейный'),
(255, 'пер. Ананьинский'),
(256, 'пер. Ботанический'),
(257, 'пер. Верхний'),
(258, 'пер. Главный'),
(259, 'пер. Грязовецкий'),
(260, 'пер. Движенческий'),
(261, 'пер. Детский'),
(262, 'пер. Долгий'),
(263, 'пер. Ершовский'),
(264, 'пер. Железнодорожный'),
(265, 'пер. Заболотный'),
(266, 'пер. Завражский'),
(267, 'пер. Западный'),
(268, 'пер. Застроечный'),
(269, 'пер. Индивидуальный'),
(270, 'пер. Индустриальный'),
(271, 'пер. Клубный'),
(272, 'пер. Кольцевой'),
(273, 'пер. Конечный'),
(274, 'пер. Крайний'),
(275, 'пер. Кривой'),
(276, 'пер. Линейный'),
(277, 'пер. Локомотивный'),
(278, 'пер. Лукьяновский'),
(279, 'пер. Майский'),
(280, 'пер. Маяковского'),
(281, 'пер. Медуницинский'),
(282, 'пер. Межевой'),
(283, 'пер. Нагорный'),
(284, 'пер. Некрасовский'),
(285, 'пер. Никольский'),
(286, 'пер. Новый'),
(287, 'пер. Овражный'),
(288, 'пер. Огородный'),
(289, 'пер. Ольховый'),
(290, 'пер. Парковый'),
(291, 'пер. Паровозный'),
(292, 'пер. Полярный'),
(293, 'пер. Поселковый'),
(294, 'пер. Производственный'),
(295, 'пер. Прудный'),
(296, 'пер. Прядильный'),
(297, 'пер. Прямой'),
(298, 'пер. Раздельный'),
(299, 'пер. Рыбный'),
(300, 'пер. Рыночный'),
(301, 'пер. Слесарный'),
(302, 'пер. Содемский'),
(303, 'пер. Средний'),
(304, 'пер. Станционный'),
(305, 'пер. Судоремонтный'),
(306, 'пер. Техникумовский'),
(307, 'пер. Технический'),
(308, 'пер. Тихий'),
(309, 'пер. Ткацкий'),
(310, 'пер. Топливный'),
(311, 'пер. Тополевый'),
(312, 'пер. Тупиковый'),
(313, 'пер. Турундаевский'),
(314, 'пер. Узкий'),
(315, 'пер. Февральский'),
(316, 'пер. Флотский'),
(317, 'пер. Центральны'),
(318, 'пер. Центральный'),
(319, 'пер. Чернышевского'),
(320, 'пер. Школьный'),
(321, 'пер. Южная роща'),
(322, 'пер. Южный'),
(323, 'пер. Янгосорский'),
(324, 'наб. Набережная 6-ой Армии'),
(325, 'наб. Пречистенская Набережная'),
(326, 'туп. Грузовой'),
(327, 'туп. Ленинградский'),
(328, 'пр-кт. Победы'),
(329, 'пр-кт. Советский'),
(330, 'пл. Бабушкина'),
(331, 'пл. Возрождения'),
(332, 'пл. Дрыгина'),
(333, 'пл. Кремлевская'),
(334, 'пл. Революции'),
(335, 'пл. Свободы'),
(336, 'пл. Торговая'),
(337, 'пл. Чайковского'),
(338, 'проезд. Говоровский'),
(339, 'проезд. Осановский'),
(340, 'ш. А114 Вологда-Новая Ладога'),
(341, 'ш. Белозерское шоссе'),
(342, 'ш. Вологда-Норобово'),
(343, 'ш. Вологда-Ростилово'),
(344, 'ш. КАД'),
(345, 'ш. Ленинградское шоссе'),
(346, 'ш. М8 Холмогоры'),
(347, 'ш. Московское шоссе'),
(348, 'ш. Новоархангельское шоссе'),
(349, 'ш. Окружное шоссе'),
(350, 'ш. Пошехонское шоссе'),
(351, 'ш. Р5 Вологда-Медвежьегорск'),
(352, 'ш. Старое шоссе'),
(353, 'ул. Чепаева'),
(354, 'Ул. Луначарского'),
(355, 'мкр. Тепличный'),
(356, 'мкр. 1-ГПЗ'),
(357, 'мкр ПЗ-23'),
(358, 'пос. Емельяново'),
(359, 'Слаботская');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL,
  `username` varchar(200) NOT NULL,
  `password` text NOT NULL,
  `rank` int(1) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `rank`) VALUES
(2, 'redbuld', '651dbe6ee26fed364d2e8eda9ff22ff5', 3);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`),
  ADD KEY `name` (`name`(255));

--
-- Индексы таблицы `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `filters`
--
ALTER TABLE `filters`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`name`);

--
-- Индексы таблицы `streets`
--
ALTER TABLE `streets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `category`
--
ALTER TABLE `category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT для таблицы `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `filters`
--
ALTER TABLE `filters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT для таблицы `streets`
--
ALTER TABLE `streets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=360;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=3;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
